// アイコン画像定数
const baseUrl = "https://pjsekai.sega.jp/assets/img/special/dl/sns_icon/icon_unite";
const iconmap = new Map([
    ["一歌", "01_1_ichika"],
    ["咲希", "01_2_saki"],
    ["穂波", "01_3_honami"],
    ["志歩", "01_4_shiho"],
    ["Lミク", "01_5_miku"],
    ["Lルカ", "01_6_luka"],
    ["みのり", "02_1_minori"],
    ["遥", "02_2_haruka"],
    ["愛莉", "02_3_airi"],
    ["雫", "02_4_shizuku"],
    ["Mミク", "02_5_miku"],
    ["Mリン", "02_6_rin"],
    ["こはね", "03_1_kohane"],
    ["杏", "03_2_an"],
    ["彰人", "03_3_akito"],
    ["冬弥", "03_4_toya"],
    ["Vミク", "03_5_miku"],
    ["Vレン", "03_6_len"],
    ["Vメイコ", "03_7_meiko"],
    ["司", "04_1_tsukasa"],
    ["えむ", "04_2_emu"],
    ["寧々", "04_3_nene"],
    ["類", "04_4_rui"],
    ["Wミク", "04_5_miku"],
    ["Wカイト", "04_6_kaito"],
    ["奏", "05_1_kanade"],
    ["まふゆ", "05_2_mafuyu"],
    ["絵名", "05_3_ena"],
    ["瑞希", "05_4_mizuki"],
    ["Nミク", "05_5_miku"],
]);

// カテゴリ用定数
const categories = new Set([
    "一般/すべて", "一般/ベッド", "一般/テーブル", "一般/チェア", "一般/棚", "一般/観葉植物", "一般/家電", "一般/その他",
    "小物/すべて", "小物/家電", "小物/その他",
    "壁掛け", "ディスプレイ", "ぬいぐるみ", "キャンバス", "ブロック",
    "壁", "床", "ラグ", "家", "道", "カラータイル", "柵"
]);

// シリーズ用定数
const series = new Set([
    "公園", "ガーデン", "ナチュラル", "シンプルポップキッチン", "クリーンパウダールーム",
    "素朴な和室", "キッズルーム", "カジュアル", "キュート", "フレンチスタイル",
    "トレーニングルーム", "音楽スタジオ","イベント会場", "ゲームセンター", "ぽかぽかなピクニック",
    "天文学者の研究室", "きらめく流星ルーム", "かがやくクローバールーム", "鮮やかなユニゾンルーム", "はじけるクラウンルーム",
    "ひび割れたハートルーム", "はじまりのメロディルーム", "月が見える旅館", "旅人のキャンプ", "雷神祭",
    "Leo/need", "MORE MORE JUMP！", "Vivid BAD SQUAD", "ワンダーランズ×ショウタイム", "25時、ナイトコードで。", "バーチャル・シンガー"
]);

// ユニット識別子用定数
const units = new Map([
    ["L", "L/n"],
    ["M", "MMJ"],
    ["V", "VBS"],
    ["W", "W×S"],
    ["N", "N25"],
]);